DataProcessors/бит_ЗагрузкаСальдоИзЭксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаСальдоИзЭксель</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЗ</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИАС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СальдоПоРасчетномуСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СальдоПоРасчетномуСчету</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сальдо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодЗдания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ЗагрузкаСальдоИзЭксель/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
ДиалогОткрытия.МножественныйВыбор = Ложь; 
ДиалогОткрытия.Заголовок = "Выберите файл"; 
ДиалогОткрытия.Фильтр = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|*.xls|Microsoft Excel 7/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";

	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.Каталог = ДиалогОткрытия.ПолноеИмяФайла; 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьФайл(Команда)

	ФормированиеТаблицы();	

КонецПроцедуры   

&НаКлиенте
Процедура ФормированиеТаблицы()
	
Объект.ДанныеТЧ.Очистить();
ДанныеФайла = Новый ДвоичныеДанные(Объект.Каталог);
АдресДанных = ПоместитьВоВременноеХранилище(ДанныеФайла);
ФормированиеТаблицыНаСервере(АдресДанных)
	
	

КонецПроцедуры 

 &НаСервере
 Процедура ФормированиеТаблицыНаСервере(АдресДанных)

	 ТабДок = Новый ТабличныйДокумент;
	 Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	 ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(".xls");
     Данные.Записать(ПутьКФайлуНаСервере);  
	 
	 Попытка 
		 ТабДок.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	 Исключение
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Не удалось прочитать указанный файл по причине: " + ОписаниеОшибки();
		 Сообщение.Сообщить();
		 Возврат;
	 КонецПопытки; 
	 КоличествоСтрок = ТабДок.ВысотаТаблицы;
	 
			 
	 
	 Для НомерСтроки = 5 По КоличествоСтрок Цикл
		 СтрокаДанных = Объект.ДанныеТЧ.Добавить();
		 СтрокаДанных.ФИАС = ТабДок.ПолучитьОбласть("R" + НомерСтроки + "C" + 3).ТекущаяОбласть.Текст;
	     СтрокаДанных.НомерСчета = ТабДок.ПолучитьОбласть("R" + НомерСтроки + "C" + 4).ТекущаяОбласть.Текст; 
		 СтрокаДанных.Сальдо = ТабДок.ПолучитьОбласть("R" + НомерСтроки + "C" + 5).ТекущаяОбласть.Текст;
		 
		ДатаСтрока = ТабДок.ПолучитьОбласть("R" + 2 + "C"+ 2).ТекущаяОбласть.Текст; 
		ЛеваяЧастьДаты = Лев(ДатаСтрока,6);
		ПраваяЧастьДаты = Прав(ДатаСтрока,2);				
		СтрокаДанных.Дата = Дата(СокрЛП(ЛеваяЧастьДаты + "20" + ПраваяЧастьДаты) + " " + "00:00:00"); 
		 
		 
	 КонецЦикла; 
	 
   	 
		 
		 
КонецПроцедуры 
                                                    
&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)

	ЗаписатьПолученнуюТаблицуВРегистр();	

КонецПроцедуры 

&НаСервере
Процедура ЗаписатьПолученнуюТаблицуВРегистр()
   ТЗ = РеквизитФормыВЗначение("Объект");
		 Выгрузка = ТЗ.ДанныеТЧ.Выгрузить();  
		
		  Сообщить(ТипЗнч(Выгрузка));
		 ТЗ.ДанныеТЧ.Очистить();
		 
		 Запрос = Новый Запрос;
		 Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		 Запрос.УстановитьПараметр("ТЗ",Выгрузка);		
		 
		 Запрос.Текст ="ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ"; 				                		 	 
		 Запрос.Выполнить();
		 
		 Запрос.Текст ="ВЫБРАТЬ
		               |	ТЗ.ФИАС КАК ФИАС,
		               |	ТЗ.НомерСчета КАК НомерСчета,
		               |	ТЗ.Сальдо КАК Сальдо,
		               |	ТЗ.Дата КАК Дата
		               |ПОМЕСТИТЬ ВТ_ТЗ
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	лб_Тест_Дома.Здание.Код КАК ЗданиеКод,
		               |	ВТ_ТЗ.Сальдо КАК Сальдо,
		               |	ВТ_ТЗ.Дата КАК Дата,
		               |	ВТ_ТЗ.НомерСчета КАК НомерСчета
		               |ИЗ
		               |	ВТ_ТЗ КАК ВТ_ТЗ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
		               |		ПО ВТ_ТЗ.ФИАС = лб_Тест_Дома.FIAS";
		 
		 Результат = Запрос.Выполнить();
		 Выборка = Результат.Выбрать();
			 
		 
 НаборЗаписей = РегистрыСведений.бит_СальдоПоРасчетномуСчету.СоздатьНаборЗаписей();
 
 Пока Выборка.Следующий() Цикл
	 
	 НоваяЗапись = НаборЗаписей.Добавить();
	 НоваяЗапись.КодЗдания = Выборка.ЗданиеКод;
	 НоваяЗапись.РасчетныйСчет = Выборка.НомерСчета;
	 НоваяЗапись.Сальдо = Выборка.Сальдо;
	 НоваяЗапись.Период = ТекущаяДата();
	 НоваяЗапись.Дата   = Выборка.Дата;
	 
 КонецЦикла; 
 
 НаборЗаписей.Записать(Ложь);
	 		
КонецПроцедуры
